tbobd/certification2/test2/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:ClientReferenceNumber>210314135855789#aaaz</hot:ClientReferenceNumber>
        <hot:GuestNationality>AE</hot:GuestNationality>
            <hot:Guests>
                <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajayxe</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>30</hot:Age>
            </hot:Guest>
            <hot:Guest LeadGuest="false" GuestType="Child" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Antoine</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>5</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="true" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>c4312ad6-10dc-465b-90c0-acd4c1706a57</hot:SessionId>
        <hot:NoOfRooms>1</hot:NoOfRooms>
        <hot:ResultIndex>1</hot:ResultIndex>
        <hot:HotelCode>1313642</hot:HotelCode>
        <hot:HotelName>Holiday Inn Bur Dubai - Embassy District</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomTypeName>Standard Room</hot:RoomTypeName>
                <hot:RoomTypeCode>CSTNIDH20|1^^CSTNIDH20IDH20</hot:RoomTypeCode>
                <hot:RatePlanCode>CSTNIDH20IDH20</hot:RatePlanCode>
                <hot:RoomRate RoomFare="269.67" Currency="USD" AgentMarkUp="0.00" RoomTax="30.64" TotalFare="300.32"/>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>